---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures
source: html/f20dbf8f-f6e8-d2f0-8356-c18c2ea29e26.htm
---
# BuiltInFailures.ComponentRepeaterFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.